action: global
title: Valid Rule
description: Scan rule
references:
  - http://binalyze.com
author: Emre TINAZTEPE
logsource:
  os: windows
  category: case
  product: air
level: medium
tags:
  - attack.358
detection:
  selection:
    NoSection:
      Name: csrss.exe
      CommandLine|contains: SharedSection=1024,20480
  condition:  any of them
  timeframe: '5w'
