action: global
title: Valid Rule
description: Scan rule
references:
  - http://binalyze.com
author: Emre TINAZTEPE
logsource:
  os: windows
  category: case
  product: air
level: medium
tags:
  - attack.358
detection:
  selection:
    Processes:
      Name|startswith: csrss.exe
      ProcessPath|endswith: csrss.exe
      CommandLine|contains: ObjectDirectory
      Publisher|equals: Microsoft Windows Publisher
      Is32Bit: false
      FileSize: 18144
      NullProperty: null
      UserName|all:
        - '*SYSTEM*'
        - '*NT*'
        - '*LAST BOMB HERE WHICH WILL MAKE IT FAIL*'
  condition:  any of them
  timeframe: '5w'
