title: Valid Rule
description: Scan rule
references:
  - http://binalyze.com
author: Emre TINAZTEPE
logsource:
  os: windows
  category: case
  product: air
level: medium
tags:
  - attack.358
detection:
  selection:
    sub1:
      Processes:
        Name: csrss.exe
        CommandLine|contains: SharedSection=1024,20480
    sub2:
      Processes:
        Name: csrss.exe
        CommandLine|contains: SharedSection=1024,20480
  condition:  any of selection
  timeframe: '5w'
