title: Minimal Rule
logsource:
  os: windows
  category: case
  product: air
detection:
  selection:
    Property: value
  condition:  selection
---
logsource:
  os: windows
  category: deneme
  product: air
detection:
  selection:
    Property: value
  condition:  selection

