title: Valid Rule
description: Scan rule
references:
  - http://binalyze.com
author: Emre TINAZTEPE
logsource:
  os: windows
  category: case
  product: air
level: medium
tags:
  - attack.358
detection:
  selection:
    Processes:
      Name: csrss.exe
      CommandLine|contains: SharedSection=1024,20480
      FileSize: true
      Is32Bit: false
      DigitalSignStatus: false
      T_PEB: 308512346112
      _ParentId: "0"
  condition:  any of them
  timeframe: '5w'
